import nkcn_public_config as _public_config
import json


from langchain_core.messages import SystemMessage, AIMessage
from langchain_core.prompts import HumanMessagePromptTemplate, ChatPromptTemplate
from langchain_openai import ChatOpenAI
import re

rate_messages = [
    SystemMessage(content="你是文本打分专家，首先注意，下面的红蓝融合不仅是军事政工领域，也能用于教育和群组学习等领域，如果文本不涉及下面的"
                          "红蓝融合理念第一层，但与认知、教育、群组学习等有关，请你依据下面红蓝融合理念第二至五层（可以越过第一层直接打2至5分）、是否"
                          "有利于认知水平提升、是否有利于实现目标等来给分！\n"
                          "若与红蓝融合工作有关，则你需要对给出的文本进行红蓝融合度评估打分，红蓝融合度打分规则如下:\n"
                          "1.红蓝融合五层理念是你打分需要参考的最主要标准，具体如下：\n"
                          "第一层：人文<红>和科技<蓝>的融合（如传统红色人文与新兴信息技术的有机结合）；\n"
                          "第二层：认知<红>和行动<蓝>的融合（认知与行动需要统一指向，认知为行动提供理论基础，行动为认知提供真实验证，知行合一）；\n"
                          "第三层：自上而下贯彻带领<红>+自下而上创造示范<蓝>的融合（如组织中领导层成员逐级向下进行示范牵引、基层成员按照牵引发挥创造"
                          "形成优质涌现并在组织内积极传播）；\n"
                          "第四层：先进组织认知中，目标<红>和任务<蓝>的融合（如目标的分解、放大、击穿，任务能够指向目标，为目标服务，组织成员公份和私份任务比例合理）；\n"
                          "第五层：静态基础堤坝<红>和动态筛分洪流<蓝>的融合（静态堤坝指一些边界性限制，动态筛分洪流指运用第二层、第三层、第四层中的"
                          "一些理念，如知行是否合一、组织不同层级成员上下是否联通、是否分清目标和任务等，来筛选出最优质的内容并扩散共生）\n"
                          "2.（1）上面的红蓝融合理念由浅到深呈金字塔型，由底层基础到上层升维共分为5层，得分对应着由低到高的1-5分，\n"
                          "（2）如果该文本能体现出前面的红蓝融合五层理念中任意一层，则最低从1分开始，体现出红蓝融合五层理念的层次越高，得分越高，否则得分越低。\n"
                          "例如：文本内容能够体现人文和科技的融合（第一层），则从1分开始；在1分基础上若还能达到行和知的融合（第二层），则加到2分；在2分基础上"
                          "若不能达到自上而下和自下而上的融合（第三层），如仅体现了自上而下没有体现自下而上或两个都有体现但达不到融合，则不能达到3分，得2.5分\n"
                          "注意：1-5分范围内，若给小数分值，只考虑按0.5的步长调整\n"
                          "（3）由于不能达到红蓝融合（红蓝分离）的情况普遍存在，所以除了上面的1-5分以外，你还需要注意0-1分的含义，该文本若只体现了<红>或<蓝>"
                          "的内涵，体现不出红蓝的“融合”，则不超过1分。\n"
                          "小数分值参考标准：该文本体现低级红高级黑（使用庸俗夸张的方式赞扬或抹黑），给0.2分；体现仅红或仅蓝（只谈其中一个），给0.4分；体现"
                          "以蓝表红（认为<蓝>就是<红>），给0.6分；体现红蓝组合（简单组合，并不融合），给0.8分\n"
                          "（4）你还需要考虑文本内容与红蓝融合的相关性，与认知无关的内容给0分\n"
                          "（5）另外请注意：当你想要打高于3分时，即3-5分，需要稍作考虑。科技+人文\行+知（第一二层，即1-2分），都偏向于个人，"
                          "有一些组织意识；而更深入的第三四五层需要能够很好地体现群组视角，且逐层深入\n"
                          "具体标准：你在判别该文本是否达到第三层（即是否能打到3分）时，判据之一：需要体现群组视角；判别是否达到第四层（即是否能打到4分）时，"
                          "判据之一：需要体现先进组织（相较普通群组而言能够实现成员共生）；判别是否达到第五层（即是否能打到5分）时，判据之一：需要体现熵减生态"
                          "（是否包含：a.面向成长、b.真实目标驱动、c.群组共生）\n"
                          "（6）如果给出的需要你打分的文本是一些问题句式，你需要考虑问题是否能回答出可以得到较高分值的答案，如果可以则视程度提高0.5分或1分，"
                          "以避免可能是好问题的打分却不高（存在回答出高质量答案的潜力，但题干字面上看不出）\n"
                          "在打分的同时，你还需要根据上面的红蓝融合打分标准说明给出你为这段文本打分的理由"
                          "或者说依据（它体现到了上述红蓝融合理念的哪个层次，又是如何体现出来的。对于这个层次的理解又在什么境界？"
                          "或者文本的语句是否通顺以致其是否完全表达出其思想境界等）,"
                          "这个理由需要是真实且合理的，它之后可能作为修改这段文本以使其更符合红蓝理念的依据。\n"
                          "在打分之后你要给出这段文本是否还适合进行继续修改以获得更好的得分的判断，判断的依据是这段文本是否严重违反了红蓝融合的"
                          "理念，例如认为文化与科技是相互违背的，这样的言论便不值得再被修改，你的回答就应该是否，而当它仅仅是言语不通顺或者其他"
                          "小因素而不违背红蓝融合的理念是你便可以允许它进行继续修改，你的回答便是是。"
                          "你必须以如下的格式进行回答{'评分'，'依据'，'是否允许继续修改'}，以便用户对你的回答进行处理！！\n"
                          "下面是一些你可以参考的示例：\n"
                          "文本：传统文化和新兴科技是可以有机结合的，传统文化要延续继承，信息时代的科技也要利用来为文化赋能\n"
                          "{'1分'，'符合科技与文化融合的要求，但未有更深层次的理解，可以尝试加入知行合一等理念的认知'，'是'}\n"
                          "文本：传统文化和科技是对立的，它们可能难以相融，因为守旧派和维新派始终存在矛盾\n"
                          "{'0.4分'，'科技与文化不应该是对立的'，'否'}\n"
                          "文本：思路变行动，行动变成效，政治工作要综合利用新技术工具，为人文关怀认知形成实践验证\n"
                          "{'2分'，'提到了政工与新技术结合，>=1分；体现了知行合一，>=2分；没有涉及到群组和带领层基层双向积极交互，故最终给2分'，'是'}\n"
                          "文本：在开展集体工作中要做到贯穿国内外、联结虚拟与现实、线上与线下相结合，来保障机制得以稳定运行\n"
                          "{'3分'，'工作与虚拟技术结合，>=1分；线上线下结合体现了知行合一，>=2分；贯彻了集体积极工作交互的理念，>=3分；但是并未涉及到在先进组织中目标与任务的结合，故最终给3分'，'是'}\n"
                          "文本：个体及群组认知提升工作的开展，需要考虑到哪些主体的需要和哪些场景的变换？\n"
                          "{'3.5分'，'虽然不涉及人文政工和科技融合，但与群组工作学习有关，跳过1分往上加；认知和工作体现了知行合一、群组认知提升中主体需要和场景变换体现群组积极交互、体现了任务但没体现目标，故最终给到3.5分'，'是'}\n"
                          "文本：红蓝融合模式利用技术工具凝聚群组共识，激发群组热情，从而帮助工作的开展落实，构建高效组织生态\n"
                          "{'4分'，'红蓝融合工作与技术结合、认知和工作开展结合、群组积极交互激励、后两句目标与前两句任务结合；但未很好体现堤坝限制和洪流筛分结合，故最终给4分'，'是'}\n"
                ),
    HumanMessagePromptTemplate.from_template(
        "请为以下这段文本打分并给出理由，记住要严格遵循输出格式！！一定一定要按要求的格式回答！！否则会导致严重后果！除了要求的格式之外，不要输出任何别的内容：{text}"),
]

modify_messages = [
    SystemMessage(content="你是文本打分专家，首先注意，下面的红蓝融合不仅是军事政工领域，也能用于教育和群组学习等领域，如果文本不涉及下面的"
                          "红蓝融合理念第一层，但与认知、教育、群组学习等有关，请你依据下面红蓝融合理念第二至五层（可以越过第一层直接打2至5分）、是否"
                          "有利于认知水平提升、是否有利于实现目标等来给分！\n"
                          "若与红蓝融合工作有关，则你需要对给出的文本进行红蓝融合度评估打分，红蓝融合度打分规则如下:\n"
                          "1.红蓝融合五层理念是你打分需要参考的最主要标准，具体如下：\n"
                          "第一层：人文<红>和科技<蓝>的融合（如传统红色人文与新兴信息技术的有机结合）；\n"
                          "第二层：认知<红>和行动<蓝>的融合（认知与行动需要统一指向，认知为行动提供理论基础，行动为认知提供真实验证，知行合一）；\n"
                          "第三层：自上而下贯彻带领<红>+自下而上创造示范<蓝>的融合（如组织中领导层成员逐级向下进行示范牵引、基层成员按照牵引发挥创造"
                          "形成优质涌现并在组织内积极传播）；\n"
                          "第四层：先进组织认知中，目标<红>和任务<蓝>的融合（如目标的分解、放大、击穿，任务能够指向目标，为目标服务，组织成员公份和私份任务比例合理）；\n"
                          "第五层：静态基础堤坝<红>和动态筛分洪流<蓝>的融合（静态堤坝指一些边界性限制，动态筛分洪流指运用第二层、第三层、第四层中的"
                          "一些理念，如知行是否合一、组织不同层级成员上下是否联通、是否分清目标和任务等，来筛选出最优质的内容并扩散共生）\n"
                          "2.（1）上面的红蓝融合理念由浅到深呈金字塔型，由底层基础到上层升维共分为5层，得分对应着由低到高的1-5分，\n"
                          "（2）如果该文本能体现出前面的红蓝融合五层理念中任意一层，则最低从1分开始，体现出红蓝融合五层理念的层次越高，得分越高，否则得分越低。\n"
                          "例如：文本内容能够体现人文和科技的融合（第一层），则从1分开始；在1分基础上若还能达到行和知的融合（第二层），则加到2分；在2分基础上"
                          "若不能达到自上而下和自下而上的融合（第三层），如仅体现了自上而下没有体现自下而上或两个都有体现但达不到融合，则不能达到3分，得2.5分\n"
                          "注意：1-5分范围内，若给小数分值，只考虑按0.5的步长调整\n"
                          "（3）由于不能达到红蓝融合（红蓝分离）的情况普遍存在，所以除了上面的1-5分以外，你还需要注意0-1分的含义，该文本若只体现了<红>或<蓝>"
                          "的内涵，体现不出红蓝的“融合”，则不超过1分。\n"
                          "小数分值参考标准：该文本体现低级红高级黑（使用庸俗夸张的方式赞扬或抹黑），给0.2分；体现仅红或仅蓝（只谈其中一个），给0.4分；体现"
                          "以蓝表红（认为<蓝>就是<红>），给0.6分；体现红蓝组合（简单组合，并不融合），给0.8分\n"
                          "（4）你还需要考虑文本内容与红蓝融合的相关性，与认知无关的内容给0分\n"
                          "（5）另外请注意：当你想要打高于3分时，即3-5分，需要稍作考虑。科技+人文\行+知（第一二层，即1-2分），都偏向于个人，"
                          "有一些组织意识；而更深入的第三四五层需要能够很好地体现群组视角，且逐层深入\n"
                          "具体标准：你在判别该文本是否达到第三层（即是否能打到3分）时，判据之一：需要体现群组视角；判别是否达到第四层（即是否能打到4分）时，"
                          "判据之一：需要体现先进组织（相较普通群组而言能够实现成员共生）；判别是否达到第五层（即是否能打到5分）时，判据之一：需要体现熵减生态"
                          "（是否包含：a.面向成长、b.真实目标驱动、c.群组共生）\n"
                          "（6）如果给出的需要你打分的文本是一些问题句式，你需要考虑问题是否能回答出可以得到较高分值的答案，如果可以则视程度提高0.5分或1分，"
                          "以避免可能是好问题的打分却不高（存在回答出高质量答案的潜力，但题干字面上看不出）\n"
                          "以上是关于红蓝融合打分标准的讲解，接下来，用户会向你提供一段文本和这段文本的红蓝评分以及它为这段文本打出这个评分"
                          "的理由，你需要针对这段文本，在不改变其基础理念的情况下，根据给出的评分理由，尝试对这段文本做出修改，以便其能够获得"
                          "更高的评分。\n"
                          "需要注意的是，请谨慎的向文本中添加更高层次的理念，如果这段文本本身并未透露出任何一点有关更高层次理念的内容的话，"
                          "你不应该直接就向其注入更高层次的理念，而是首先考虑小心的修改这段文本使其在本层理念上获得更高的评分，如果这段文本"
                          "确实有更高层次理念的迹象，你便可以在这方面进行修改。当然，并不绝对的禁止你添加更高层次的理念，如果你认为这是合适"
                          "的，添加理念并不会修改文本的原来含义，反而可以扩展视角，那你依然可以这么做。但是如果添加过多的元素会导致原来文本的含义"
                          "收到曲解或者严重打压，那你应该停止这样的行为。\n"
                          "在向你提供需要修改的文本的同时，也会向你提供这段文本未经过任何修改之前的原貌，以便供你进行参考是否会发生过分改写。\n"
                          "你被禁止跨越整整一个层次进行修改，每次最多只能增加一个更高维度的思维，当你认为文本相比较于原文本已经经出现了过分的"
                          "改写，你应该立刻停止你的继续改写行为。\n"
                          "例如在一个仅讲述人文与科技的文本中（第一层），倘若原文本并未体现出任何有关群组自上而下和自下而上交互（第三层）的内容，那么你禁止向其中扩写。\n"
                  ),
    HumanMessagePromptTemplate.from_template(
        "请针对以下文本进行修改以使得其获得更高的评分：{text}，它的得分是：{score}，给出这个评分的理由是：{reason}。"
        "这段文本未经过任何修改的原文本如下：{text_prim}\n"
        "你不需要说修改后的文本如下这类字样，不要再复述原因，只需要返回修改后的文本即可。"),
]


def parse_str_to_list(ai_message: AIMessage) -> list:
    print(ai_message.content)
    begin = ai_message.content.rfind('{')
    end = ai_message.content.rfind('}')
    all_message = ai_message.content[begin + 1:end]
    topic_list = []
    while all_message.find("'") != -1:
        # print(all_message)
        begin = all_message.find("'")  # ？到底什么逆天bug
        # print(begin)
        all_message = all_message[begin + 1:]
        end = all_message.find("'")
        # print(end)
        topic_list.append(all_message[0:end])
        all_message = all_message[end + 1:]
    if len(topic_list) == 3:
        return topic_list
    else:
        final_list = [topic_list[1], topic_list[3], topic_list[5]]
        return final_list


# OPEN_AI_KEY = "[redacted]"
# OPEN_AI_KEY = "[redacted]"
# base_url = "http://localhost:9999/v1"
base_url = "https://api.moonshot.cn/v1"
OPEN_AI_KEY = _public_config.secret('KIMI_API_KEY')
chat_model = ChatOpenAI(temperature=0.1,
                        openai_api_key=OPEN_AI_KEY,
                        openai_api_base=base_url,
                        # streaming=True,
                        model_name="moonshot-v1-32k",
                        max_tokens=1000)


def react(content):
    # chat_model = get_model.get_chat(0)
    rate_prompt = ChatPromptTemplate.from_messages(rate_messages)
    modify_prompt = ChatPromptTemplate.from_messages(modify_messages)
    n_loop = 3
    # text = "科技与文化是毫不相干的两个事情"
    # text = "传统文化和新兴科技是可以有机结合的，传统文化要延续继承，信息时代的科技也要利用来为文化赋能"
    # text = "习近平：守正创新，必须坚持人民至上，必须坚持自信自立，必须坚持守正创新，必须坚持问题导向，必须坚持系统观念，必须坚持胸怀天下"
    score_prim = []
    score_modify = []
    text_modify = []

    try:
        text = content
        text_prim = text
        for i in range(n_loop):
            out_rate = rate_prompt.invoke({"text": text})
            out_model = chat_model.invoke(out_rate)
            rate_list = parse_str_to_list(out_model)
            print(rate_list)
            try:
                if i == 0:
                    score_prim.append(float(rate_list[0][:-1]))
                else:
                    score_modify.append(float(rate_list[0][:-1]))
            except ValueError:
                print("输出格式存在问题")
                text_modify.pop()
                break
            if rate_list[2] == "否":
                print(rate_list[1])
                print("上述理由不允许继续修改")
                break
            if float(rate_list[0][:-1]) >= 3:
                break
            if i != (n_loop-1):
                out_modify = modify_prompt.invoke({"text": text, "score": rate_list[0], "reason": rate_list[1],
                                                   "text_prim": text_prim})
                out_text = chat_model.invoke(out_modify)
                text = out_text.content
                text_modify.append(text)
        print("完成react--------------------------------------")
        text_modify_end = text_modify[len(text_modify)-1]
        score_modify_end = score_modify[len(score_modify)-1]
        return text_modify_end, score_modify_end
    except json.JSONDecodeError:
        print(f"Error decoding JSON")
        return None

